{
  "фізика": {
    "Рівняння Ейнштейна для мас-енергії": {
      "action": "formula",
      "value": "E = m*c**2"
    },
    "Закон Кулона": {
      "action": "formula",
      "value": "F = (k*(q1*q2))/r**2"
    }
  },
  "математика": {
    "Знайти найбільший спільний дільник або найменше спільне кратне двох числел": {
      "action": "unique",
      "value": "nod_nok"
    },
    "Формула векторного добутку векторів": {
      "action": "unique",
      "value": "vector_multiply"
    },
    "Формула для обчислення відстані від точки до прямої в просторі": {
      "action": "unique",
      "value": "distance_from_dot_to_line"
    },
    "Площа трикутника": {
      "action": "formula",
      "value": "S = 0.5*b*h"
    }
  },
  "географія": {
    "Який океан найбільший за площею?": {
      "action": "text",
      "value": "Тихий океан найбільший за площею: 178,7 млн. км2. Води океану омивають береги всіх континентів Землі, крім Африки."
    },
    "Яка держава має найбільшу кількість озер в світі?": {
      "action": "text",
      "value": "Фінляндія. Незважаючи на скромні розміри, на території цієї країни озер вмістилося майже 190 тисяч, і вони покривають близько 9%всієї фінської території. "
    },
    "Назвіть дві держави, які мають найбільшу кількість водосховищ в світі.": {
      "action": "text",
      "value": "мордор та Канада"
    }
  },
  "філологія": {
    "Які часи є в англійській мові?": {
      "action": "text",
      "value": "Теперішні часи: Present Simple, Present Continuous, Present Perfect, Present Perfect Continuous\nМинулі часи: Past Simple, Past Continuous, Past Perfect, Past Perfect Continuous\nМайбутні часи: Future Simple, Future Continous, Future Perfect, Future Perfect Continuous"
    },
    "Яка різниця між Some та Any?": {
      "action": "text",
      "value": "Any використовується для запитань і заперечень, у той час, як some — для тверджень"
    },
    "Які відмінки є в українській мові?": {
      "action": "text",
      "value": "В українській мові налічують сім відмінків: називний, родовий, давальний, знахідний, орудний, місцевий і кличний."
    }
  },
  "aстрономія": {
    "Які планети нашої Сонячної системи є газовими гігантами?": {
      "action": "text",
      "value": "У Сонячній системі це Юпітер і Сатурн."
    },
    "Які типи зір відомі в астрономії?": {
      "action": "text",
      "value": "Сім основних типів зірок включають O, B, A, F, G, K і M, кольори від синього до червоного."
    },
    "Як впливає зоряне світло на здоров'я людини?": {
      "action": "text",
      "value": "123"
    }
  }
}